src/InformationRegisters/ОсновныеДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеДоговорыКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОсновныеДоговорыКонтрагентов/Ext/ManagerModule.bsl
Процедура ЗаписатьДанныООсновномДоговореПоСтруктуре(СтруктураЗаписи) Экспорт
ОсновнойДоговорМЗ = РегистрыСведений.ОсновныеДоговорыКонтрагентов.СоздатьМенеджерЗаписи();
ЗаполнитьЗначенияСвойств(ОсновнойДоговорМЗ,СтруктураЗаписи);
ОсновнойДоговорМЗ.Записать();


	
КонецПроцедуры	

Функция ПолучитьДоговор(Организация, Контрагент, ВидДоговора) Экспорт
	
	ДоговорКонтрагента = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеДоговорыКонтрагентов.ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.ОсновныеДоговорыКонтрагентов КАК ОсновныеДоговорыКонтрагентов
		|ГДЕ
		|	ОсновныеДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ОсновныеДоговорыКонтрагентов.Организация = &Организация
		|	И ОсновныеДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
	КонецЕсли;
	
	Возврат ДоговорКонтрагента;
	
КонецФункции
